rm (list = ls (all = TRUE))

library(wordcloud2) # 加载包



# 创建一个数据框
keywords <- c(
  "围生期抑郁", "筛查", "认知行为疗法", "实施性研究", "远程医疗", "边远地区", "基层卫生",
  "运行机制", "常态化过程理论", "艾滋病", "HIV检测", "男男性接触人群", "社会交换理论",
  "实施科学", "自杀风险", "简短联系干预", "精神障碍出院患者", "序列多次分组随机对照试验",
  "护理", "银屑病", "健康照护模式", "生活质量", "实施科学", "卫生政策",
  "卫生改革", "基层医疗机构", "电子药盒+手机APP诊疗管理模式", "优化机制", "社区卫生服务",
  "糖尿病", "共享门诊", "多阶段优化策略", "实施科学", "卫生体系", "运行机制",
  "患者安全", "风险协同管理", "实施科学", "医疗卫生服务系统", "简短戒烟干预",
  "基层卫生保健", "多阶段优化策略", "实施科学", "中医药服务", "质量安全",
  "临床实践指南", "实施科学", "适用性评价", "公共卫生服务", "实施科学", "艾滋病",
  "HIV自愿咨询检测", "城市服务网", "健康管理", "低龄儿童龋", "基层医疗",
  "实施科学", "整群随机对照试验", "卫生保健", "公共卫生体系", "产后抑郁症",
  "干预效果", "实施科学", "社区卫生", "自杀风险管理", "游戏化mHealth干预",
  "多阶段优化策略", "实施科学", "社区卫生服务", "公共卫生服务", "结核病防治管理",
  "多中心阶梯随机对照试验", "医疗卫生服务系统", "合理用药", "循证用药指南", "实施科学",
  "临床药学", "甲氨蝶呤", "健康管理", "社区全科医生", "实施科学",
  "多阶段优化策略", "老年轻度认知障碍患者", "食管肿瘤", "证据转化", "障碍机制",
  "加速康复", "干预策略", "疾病预防控制", "高危人群", "健康服务",
  "健康管理", "效果评价", "医疗运作管理", "医护人员", "临床实践指南",
  "行为改变", "指南实施"
)

# 创建一个数据框
word_freq_df <- data.frame(word = keywords, freq = rep(1, length(keywords)))

# 合并相同的词并计算频率
word_freq_df <- aggregate(freq ~ word, word_freq_df, sum)


wordcloud2(word_freq_df)



# 调整字体大小
wordcloud2(word_freq_df, size = 1.5)



wordcloud2(word_freq_df, 
           size = 1, 
           minRotation = -pi/8, #单词旋转最小角度
           maxRotation = pi/8,  #单词旋转最大角度
           rotateRatio = 0.9   #旋转率
)
